ivanthengwr/sticks3/sticks3_speaker_menu/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (8MB Octal on StickS3)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# Log
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# More brownout margin when pump inrush sags USB VBUS (rebuild: idf.py fullclean build)
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_1=y
